In [1]:
# pip install pymysql
# pip install sqlalchemy

import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("mysql+pymysql://admin:Trrp3141!@localhost/publications")

In [3]:
data = pd.read_sql_query('SELECT * FROM sakila.actor', 
                        engine)

In [5]:
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [12]:
query = """
SELECT asia.country, COUNT(asia.customer_id), COUNT(DISTINCT asia.city), COUNT(Distinct asia.postal_code)
FROM (
SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'Japan'

UNION ALL 

SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'China'

UNION ALL 

SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'Taiwan' ) asia
GROUP BY country;
"""

In [13]:
data = pd.read_sql_query(query, 
                        engine)

In [14]:
data

,country,COUNT(asia.customer_id),COUNT(DISTINCT asia.city),COUNT(Distinct asia.postal_code)
0,China,53,53,53
1,Japan,31,31,31
2,Taiwan,10,10,10

In [15]:

countries = ['Japan', 'China', 'Taiwan']


query = f"""
SELECT asia.country, COUNT(asia.customer_id), COUNT(DISTINCT asia.city), COUNT(Distinct asia.postal_code)
FROM (
SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'Japan'

UNION ALL 

SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'China'

UNION ALL 

SELECT cu.customer_id, date_format(cu.create_date, '%%Y-%%m') AS 'Date_register', cu.first_name, cu.last_name, 
ad.address_id, ad.address, ad.city_id, ad.postal_code, ci.city, ci.country_id, co.country
FROM sakila.customer cu
LEFT JOIN sakila.address ad ON cu.address_id = ad.address_id
LEFT JOIN sakila.city ci ON ad.city_id = ci.city_id
LEFT JOIN sakila.country co ON ci.country_id = co.country_id 
WHERE co.country = 'Taiwan' ) asia
GROUP BY country;
"""